package lesson_2.hw.main;

// Составьте программу, выводящую на экран квадраты чисел от 10 до 20 включительно

public class HW13 {
    public static void main (String[] arg){

        for (int i = 10; i <= 20; i++){
            System.out.print(" " + i * i);
        }
    }
}
